; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v7 - type_2 ?v3 - type_1)
 	      (pred_4 ?v1 - object ?v3 - type_1)
	      (pred_2 ?v7 - type_2 ?v8 - type_3)
	      (pred_1 ?v7 - type_2 ?v1 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v7 - type_2 ?v2 ?v5 - type_1)
       :precondition (and  (pred_3 ?v7 ?v2))
       :effect (and  (pred_3 ?v7 ?v5)
		     (not (pred_3 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v4 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v4 ?v6) (pred_3 ?v7 ?v6) (pred_2 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v4 ?v8)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_2 ?v4 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v4 ?v8) (pred_3 ?v7 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_2 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v4 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_2
obj_04 obj_03 obj_12 obj_07 - type_3
obj_05 obj_10 obj_08 - type_1
obj_09 obj_01 obj_11 - object)
(:init
(pred_3 obj_06 obj_08)
(pred_2 obj_06 obj_04)
(pred_2 obj_06 obj_03)
(pred_3 obj_02 obj_08)
(pred_2 obj_02 obj_12)
(pred_2 obj_02 obj_07)
(pred_4 obj_09 obj_05)
(pred_4 obj_01 obj_10)
(pred_4 obj_11 obj_08)
)
(:goal
(and
(pred_4 obj_09 obj_05)
(pred_4 obj_01 obj_05)
(pred_4 obj_11 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_06 obj_10)))
)
)

; plan
1. (op_3 obj_06 obj_08 obj_05)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_05)
   goals met: 2 of 3
2. (op_3 obj_02 obj_08 obj_10)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_10)
   goals met: 2 of 3
3. (op_1 obj_02 obj_01 obj_10 obj_07)
   deleted: (pred_4 obj_01 obj_10) (pred_2 obj_02 obj_07)
   added: (pred_1 obj_02 obj_01 obj_07)
   goals met: 2 of 3
4. (op_3 obj_02 obj_10 obj_05)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_05)
   goals met: 2 of 3
5. (op_2 obj_02 obj_01 obj_05 obj_07)
   deleted: (pred_1 obj_02 obj_01 obj_07)
   added: (pred_4 obj_01 obj_05) (pred_2 obj_02 obj_07)
   goals met: 3 of 3
